articles/magic.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-30 Tue 22:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Not a Mage</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="https://planetbanatt.net/css/default_20240614.css" />
<link rel="shortcut icon" type="image/jpg" href="https://planetbanatt.net/favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee/index.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</a></li>
            <li class="dark-mode-nav-item"><a href="#" class="dark-mode-toggle-nav" onclick="toggleDarkMode(); return false;">🌙</a></li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">Not a Mage</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org13f4f21">Not a Mage</a>
<ul>
<li><a href="#orgd48ff6c">I</a></li>
<li><a href="#org46b91a7">II</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org13f4f21" class="outline-1">
<h1 id="org13f4f21">Not a Mage</h1>
<div class="outline-text-1" id="text-org13f4f21">
</div>
<div id="outline-container-orgd48ff6c" class="outline-2">
<h2 id="orgd48ff6c">I</h2>
<div class="outline-text-2" id="text-orgd48ff6c">
<p>
Sixty years ago, the genesis meteor fell upon the earth. It was not a huge meteor or anything, so nobody got hurt right away. But soon after it fell, they determined that it had been carrying lots of these microscopic creatures on it, which subsequently released into the air like spores. It was like a sick joke: all those years spent searching for extraterrestrial life, and one day a big rock smashed into us to establish first contact. 
</p>

<p>
People were really worried about these creatures at first. It became immediately clear that these organisms were highly invasive, and they spread to every continent within days of the initial meteor impact. They were resilient, primarily airborne, and would occasionally kick up giant “dust storms” in certain climates. But the wave of initial panic wore off, and the organisms were deemed unthreatening to human civilization. People began to treat them like a new, mundane type of pollen which now happened to exist everywhere. 
</p>

<p>
Ten years later, a young girl from Maine fell gravely ill and was checked into a local hospital. She presented with what seemed a lot like routine pneumonia symptoms, but partway through treatment she began vomiting flames. Nobody really understood what was happening, obviously. She reported difficulty breathing, intense nausea, and then would “dump it all out” by “getting all the fire out of her lungs.” Strangest of all, she seemed completely unharmed by this; she was never burned by her own flames, even when they lit nearby flammable objects on fire. It was like a regular flame but somehow <i>alive</i>, able to choose its targets.
</p>

<p>
This young girl was the first recorded mage. It was eventually determined that the microbes, now with ubiquitous presence in the air at all times, had evolved some special mechanism to bind with each other inside human lungs. Once pulled together, they could do various things once re-exposed to the outside air: create fire, lift things off the ground, and so on. It didn’t take long after that for people to start calling the microbes <i>magic</i>.
</p>

<p>
War broke out soon after, short but ugly. Various governments and corporations began intensely researching magic, and it was quickly determined that certain people had innate “affinity” to magic manipulation. These people were quickly scouted, turned into weapons of war, and deployed upon each other en masse. More sophisticated techniques for manipulating magic were developed in a short time, and lots of people died in the resulting power struggle.
</p>

<p>
My quiet, remote hometown was one of the safe haven enclaves, established during the war by people fleeing the devastation brought upon by magic users. It became an annual tradition to test everyone in the town for affinity, and to expel anyone from the town who demonstrated any ability to use magic. At first many were expelled, young kids separated from their families, mothers taken from their children, all in service of preventing magic from ravaging the town. But affinity was mostly genetic, so after a couple generations the project was considered a huge success: nobody had been expelled for over fifteen years. The expulsion ceremony had evolved into a harmless little cultural event. Most people just called it the expulsion festival now. 
</p>
</div>
</div>

<div id="outline-container-org46b91a7" class="outline-2">
<h2 id="org46b91a7">II</h2>
<div class="outline-text-2" id="text-org46b91a7">
<p>
The candle on my desk flickered with flame. It was dancing around, brimming with enthusiasm, mocking me. I pinched the candle's wick to put out the flame. Once I took my hand away, it sprung alight all over again.
</p>

<p>
No, no no no no no.
</p>

<p>
Focus. Focus. The first mage had pneumonia symptoms, right. This must have something to do with breathing. There’s probably some weird edge case where this could happen to anybody. Breathe. It feels grainy. The air feels warm. I can try holding my breath, as a test.
</p>

<p>
I put out the candle. This time, the flame stayed out. Problem solved. I just have to stop breathing. I exhaled and the light flickered back on. At the very least now I have isolated the source of the problem. I am not a mage. This is not affinity. There’s just something wrong with how I’m breathing.
</p>

<p>
The air feels grainy. I have to focus on that. The exhale feels grainy just like the inhale. What if I try to change the way I exhale? What if there was some way to exhale cleanly without the grainy sensation? 
</p>

<p>
I tried a few different ways before it eventually clicked. Inhale as normal. Exhale from the nose, then the chest, then the diaphragm, all in a single outbreath. The grainy texture emerges when exhaling out-of-sequence from this, but in this specific order the breath comes out perfectly clean. Inhale grainy, exhale clean. I put the candle out. Inhale grainy, exhale clean. The candle stayed out. A wave of relief washed over me. I’m not a mage. I’m not a mage. I fixed it. It’s all better now.
</p>

<p>
My throat and chest started to feel scratchy. I didn’t care at all. If it meant I wasn’t a mage I could just stay like this forever. Clean exhales only. I could control it. There’s no way I could be a mage. I could feel the insides of my mouth start tingling. This is just how everybody feels all the time. The stomach churning is normal. The chest pressure is normal. The sensation of panic is normal. Given enough time I could imagine it fading into the background along with everything else.
</p>

<p>
I turned away from my desk and retched. A string of flame erupted directly from my mouth. I felt so much better. The candle on my desk flickered alight. 
</p>

<p>
This cannot be happening to me. I can’t be a mage. My whole town hates mages. I never wanted to be a mage. If they think I’m a mage they’ll banish me from the town. Maybe they’ll kill me. Maybe I’ll die even if they don’t. I have to hide it. I can get better at hiding this. People won’t understand the difference between whatever is wrong with me and being a real mage. 
</p>

<p>
I’ve always thought that my ultimate dream in life was to grow up and be a regular person. I would do just fine in school, get a reasonable enough job in my hometown, and live peacefully with a family. This tiny candle on my desk was burning it all down. My future. My relationships. Everything I ever wanted for myself. All of it going up in this tiny, harmless flame.
</p>

<p>
I tried to run through the names of everybody I knew, anyone that could help me with this, anybody I could even talk to about it. But it all came up completely blank. My family. My friends. Everybody around me. It’s critical that I don’t ever talk with anyone about this. Magic is evil. I can’t be evil. Nobody is going to be receptive to the idea that I might be evil. Nobody is going to tolerate my fear that something about me is evil.
</p>

<p>
The candle burned, bold and unflinching. <i>You are a mage</i>, it was saying. <i>You better pack your things</i>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
